# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 12  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 1, ShuffleAttention, [16, 8]], #2
   [-1, 3, C3, [128]], #3
   [-1, 1, nn.MaxPool2d, [2, 2, 0]], #4
   [-2, 1, Conv, [256, 3, 2]],  # 5-P3/8
   [-1, 6, C3, [256]], #6
   [-1, 1, nn.MaxPool2d, [2, 2, 0]], #7
   [-2, 1, Conv, [512, 3, 2]],  # 8-P4/16
   [-1, 9, C3, [512]], #9
   [-1, 1, Conv, [1024, 3, 2]],  # 10-P5/32
   [-1, 3, C3, [1024]], #11
   [-1, 1, SPPF, [1024, 5]],  # 12
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7, 9], 1, BiFPN_Concat3, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4, 6], 1, BiFPN_Concat3, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [[20], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
